In [2]:
import pandas as pd
dt=pd.read_excel('Groups.xlsx')
dt

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [3]:
dt.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [4]:
dt.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [5]:
dt.head(3)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31

In [6]:
dt.shape

(7, 3)

In [7]:
dt.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [8]:
dt.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [9]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes